Конфигурация/InformationRegisters/ПодтверждениеОперацийБэкОфиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПодтверждениеОперацийБэкОфиса</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подтверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РучнойРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодтверждаемыеОперацииБэкОфиса</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ПодтверждениеОперацийБэкОфиса/Forms/ФормаПодтвержденияГруппыОпераций/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыбранныеОперации = Неопределено;
	Если Не Параметры.Свойство("Операции", ВыбранныеОперации) ИЛИ ВыбранныеОперации = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан или не заполнен параметр 'Операции'", , , , Отказ);
		Возврат;
	КонецЕсли;
	
	НеподтвержденныхОперации = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ИсключитьПодтвержденныеОперации(ВыбранныеОперации);
	
	ЭтаФорма.Операции.Загрузить(НеподтвержденныхОперации);
	УстановитьФлажки(ЭтаФорма, Истина);
	
	Если НеподтвержденныхОперации.Количество() <> ВыбранныеОперации.Количество() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Несколько операций, подтвержденных ранее, были исключены из списка");	
	КонецЕсли;
	
	ДоступныеОснования = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ПолучитьДоступныеОснования();	
	Элементы.Основание.СписокВыбора.ЗагрузитьЗначения(ДоступныеОснования);
КонецПроцедуры

&НаКлиенте
Процедура ОперацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Операции.ТекущиеДанные;
	
	ОткрытьЗначение(ТекущиеДанные.Операция);
КонецПроцедуры

&НаКлиенте
Процедура ОперацииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодтвердитьОперации(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПодтвержденныеОперации = ПодтвердитьГруппуОперацийНаСервере();
	
	Оповестить("ПодтверждениеОперации", ПодтвержденныеОперации);
	
	Если ЭтаФорма.Операции.Количество() = 0 Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	УстановитьФлажки(ЭтаФорма, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	УстановитьФлажки(ЭтаФорма, Истина);
КонецПроцедуры

&НаСервере
Функция ПодтвердитьГруппуОперацийНаСервере()
	ВыбранныеОперации = ЭтаФорма.Операции.Выгрузить(Новый Структура("Выбран", Истина)).ВыгрузитьКолонку("Операция");	
	
	ПодтвержденныеОперации = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ПодтвердитьОперации(ВыбранныеОперации, ЭтаФорма.Основание, ЭтаФорма.ДатаПодтверждения, ЭтаФорма.Примечание);
	ПодтвержденныеОперации.Индексы.Добавить("Операция");	
	
	БылоОпераций = ЭтаФорма.Операции.Количество();
	Для н = -БылоОпераций По -1 Цикл
		СтрокаОперации = ЭтаФорма.Операции[-1-н];
		Если ПодтвержденныеОперации.Найти(СтрокаОперации.Операция, "Операция") = Неопределено Тогда
			СтрокаОперации.Выбран = Истина;		
		Иначе
			ЭтаФорма.Операции.Удалить(СтрокаОперации);		
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПодтвержденныеОперации.ВыгрузитьКолонку("Операция"); 
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлажки(ЭтаФорма, ЗначениеФлажка)
	Для Каждого СтрокаОперации Из ЭтаФорма.Операции Цикл
		СтрокаОперации.Выбран = ЗначениеФлажка; 		
	КонецЦикла;
КонецПроцедуры
